/* Localizable strings for default.syndtheme
   This file is manually, NOT automatically, generated. */

/* SortType names: */
"kSortType-0"       = "Päivämäärä";
"kSortType-1"       = "Otsikko";
"kSortType-2"       = "Lähde";
"kSortType-3"       = "Uusi";

/* TimeSlice names: */
"kTimeSlice-0"      = "Kaikki";
"kTimeSlice-1"      = "Tänään";
"kTimeSlice-2"      = "Eilen";
"kTimeSlice-3"      = "Viimeisimmät seitsemän päivää";
"kTimeSlice-4"      = "Tässä kuussa";
"kTimeSlice-5"      = "Viime kuussa";

/* Magic source name: */
"kSourceAll"        = "Kaikki";

/* Tooltips for items in source list: */
"kSourceAllToolTip" = "Näytä kaikkien syötteiden artikkelit tässä ryhmässä";
"kSourceToolTip"    = "Näytä vain artikkelit kohteesta %s";

/* Strings to display when there are no articles; keyed by the current timeslice */
"kNoArticles-0"     = "Ei artikkeleita";
"kNoArticles-1"     = "Ei artikkeleita tänään";
"kNoArticles-2"     = "Ei artikkeleita eilen";
"kNoArticles-3"     = "Ei artikkeleita tällä viikolla";
"kNoArticles-4"     = "Ei artikkeleita tässä kuussa";
"kNoArticles-5"     = "Ei artikkeleita viime kuussa";

/* Strings for the alert banner.  The first version is used when displaying a single feed.  The second version for aggregated feeds.  */
"kAuthenticationAlert-1" = "Safari ei voinut päivittää syötettä, koska se vaatii autentikoinnin. Jotta uudet artikkelit voidaan hakea, syötä seuraavat tiedot:";
"kAuthenticationAlert-2" = "Safari ei voinut päivittää syötettä ”%@”, koska se vaatii autentikoinnin. Jotta uudet artikkelit voidaan hakea, syötä seuraavat tiedot:";
"kNotFoundAlert-1"       = "Safari ei voinut päivittää syötettä, koska lähdetiedosto ei ole enää käytettävissä.";
"kNotFoundAlert-2"       = "Safari ei voinut päivittää syötettä ”%@”, koska lähdetiedosto ei ole enää käytettävissä.";
"kUnknownFormatAlert-1"  = "Safari ei voinut päivittää syötettä, koska sen sisältö ei ole tunnetussa syötemuodossa.";
"kUnknownFormatAlert-2"  = "Safari ei voinut päivittää syötettä ”%@”, koska sen sisältö ei ole tunnetussa syötemuodossa.";

"kUsername" = "Käyttäjätunnus:";
"kPassword" = "Salasana:";
"kAddToKeychain" = "Lisää avainnippuun";
"kUpdate" = "Päivitä";

/* Strings that appear in Article.syntmpl */
"kReadMore" = "Lisätietoja…";

/* Strings that appear in FOAF.syntmpl */
"kFriends"  = "Ystävät:";
"kAnd"      = "ja";
"kMore"     = "lisää…";

/* Strings that appear in Feed.html */
"kNew"              = "Uusi";
"kCountSeparator"   = ", ";
"kTotal"            = "Yhteensä";
"kSearchArticles"   = "Etsi artikkeleista:";
"kArticleLength"    = "Artikkelin pituus:";
"kSortBy"           = "Järjestä:";
"kRecentArticles"   = "Äskeiset artikkelit:";
"kColon"            = ":";                  /* used after group name in sidebar's list of sources */
"kSource"           = "Lähde:";
"kActions"          = "Toiminnot:";
"kMarkAllArticlesRead" = "Merkitse kaikki luetuiksi";
"kRefreshFeed"      = "Päivitä nyt";
"kEmailSubject"     = "Katso tämä sivu";
"kEmailBody"        = "Hei,\n\nTämä sivu saattaa kiinnostaa sinua:";
"kEmailLinkText"    = "Lähetä linkki sivulle sähköpostilla";
"kSubscribeInMail"  = "Tilaa Mailissa";
"kSubscribeInTunes" = "Tilaa iTunesissa";
"kAddBookmark"      = "Lisää kirjanmerkki…";
"kBookmarkSearch"   = "Lisää haku kirjanmerkkeihin";
"kBookmarkHelpTag"  = "Lisäämällä tämän RSS-sivun kirjanmerkkeihin saat uudet artikkelit automaattisesti.";
"kNoArticles"       = "Ei artikkeleita";

/* Strings that appear in FeedComplete.html */
"kPreviousPages"         = "edellinen…";
"kNextPages"             = "lisää…";

/* Strings that appear in Entry.html */
"kIn"         = " kohteessa ";     /* used in a construct like "John Doe in NYTimes Top Stories" */

/* Localized date/time formats for use with strftime. See DateClass.cpp */
"TodayFmtCRT"      = "Tänään, %#H.%M";
"YesterdayFmtCRT"  = "Eilen, %#H.%M";
"ThisWeekFmtCRT"   = "%A %#H.%M";
"ThisYearFmtCRT"   = "%#d. %b, %#H.%M";
"PastYearFmtCRT"   = "%#d. %b %Y, %#H.%M";

